{"format": "layers-model", "generatedBy": "keras v2.5.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "modelTopology": {"keras_version": "2.5.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 64, 64, 1], "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 7200, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 3088, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0001250000059371814, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of194.bin", "group1-shard2of194.bin", "group1-shard3of194.bin", "group1-shard4of194.bin", "group1-shard5of194.bin", "group1-shard6of194.bin", "group1-shard7of194.bin", "group1-shard8of194.bin", "group1-shard9of194.bin", "group1-shard10of194.bin", "group1-shard11of194.bin", "group1-shard12of194.bin", "group1-shard13of194.bin", "group1-shard14of194.bin", "group1-shard15of194.bin", "group1-shard16of194.bin", "group1-shard17of194.bin", "group1-shard18of194.bin", "group1-shard19of194.bin", "group1-shard20of194.bin", "group1-shard21of194.bin", "group1-shard22of194.bin", "group1-shard23of194.bin", "group1-shard24of194.bin", "group1-shard25of194.bin", "group1-shard26of194.bin", "group1-shard27of194.bin", "group1-shard28of194.bin", "group1-shard29of194.bin", "group1-shard30of194.bin", "group1-shard31of194.bin", "group1-shard32of194.bin", "group1-shard33of194.bin", "group1-shard34of194.bin", "group1-shard35of194.bin", "group1-shard36of194.bin", "group1-shard37of194.bin", "group1-shard38of194.bin", "group1-shard39of194.bin", "group1-shard40of194.bin", "group1-shard41of194.bin", "group1-shard42of194.bin", "group1-shard43of194.bin", "group1-shard44of194.bin", "group1-shard45of194.bin", "group1-shard46of194.bin", "group1-shard47of194.bin", "group1-shard48of194.bin", "group1-shard49of194.bin", "group1-shard50of194.bin", "group1-shard51of194.bin", "group1-shard52of194.bin", "group1-shard53of194.bin", "group1-shard54of194.bin", "group1-shard55of194.bin", "group1-shard56of194.bin", "group1-shard57of194.bin", "group1-shard58of194.bin", "group1-shard59of194.bin", "group1-shard60of194.bin", "group1-shard61of194.bin", "group1-shard62of194.bin", "group1-shard63of194.bin", "group1-shard64of194.bin", "group1-shard65of194.bin", "group1-shard66of194.bin", "group1-shard67of194.bin", "group1-shard68of194.bin", "group1-shard69of194.bin", "group1-shard70of194.bin", "group1-shard71of194.bin", "group1-shard72of194.bin", "group1-shard73of194.bin", "group1-shard74of194.bin", "group1-shard75of194.bin", "group1-shard76of194.bin", "group1-shard77of194.bin", "group1-shard78of194.bin", "group1-shard79of194.bin", "group1-shard80of194.bin", "group1-shard81of194.bin", "group1-shard82of194.bin", "group1-shard83of194.bin", "group1-shard84of194.bin", "group1-shard85of194.bin", "group1-shard86of194.bin", "group1-shard87of194.bin", "group1-shard88of194.bin", "group1-shard89of194.bin", "group1-shard90of194.bin", "group1-shard91of194.bin", "group1-shard92of194.bin", "group1-shard93of194.bin", "group1-shard94of194.bin", "group1-shard95of194.bin", "group1-shard96of194.bin", "group1-shard97of194.bin", "group1-shard98of194.bin", "group1-shard99of194.bin", "group1-shard100of194.bin", "group1-shard101of194.bin", "group1-shard102of194.bin", "group1-shard103of194.bin", "group1-shard104of194.bin", "group1-shard105of194.bin", "group1-shard106of194.bin", "group1-shard107of194.bin", "group1-shard108of194.bin", "group1-shard109of194.bin", "group1-shard110of194.bin", "group1-shard111of194.bin", "group1-shard112of194.bin", "group1-shard113of194.bin", "group1-shard114of194.bin", "group1-shard115of194.bin", "group1-shard116of194.bin", "group1-shard117of194.bin", "group1-shard118of194.bin", "group1-shard119of194.bin", "group1-shard120of194.bin", "group1-shard121of194.bin", "group1-shard122of194.bin", "group1-shard123of194.bin", "group1-shard124of194.bin", "group1-shard125of194.bin", "group1-shard126of194.bin", "group1-shard127of194.bin", "group1-shard128of194.bin", "group1-shard129of194.bin", "group1-shard130of194.bin", "group1-shard131of194.bin", "group1-shard132of194.bin", "group1-shard133of194.bin", "group1-shard134of194.bin", "group1-shard135of194.bin", "group1-shard136of194.bin", "group1-shard137of194.bin", "group1-shard138of194.bin", "group1-shard139of194.bin", "group1-shard140of194.bin", "group1-shard141of194.bin", "group1-shard142of194.bin", "group1-shard143of194.bin", "group1-shard144of194.bin", "group1-shard145of194.bin", "group1-shard146of194.bin", "group1-shard147of194.bin", "group1-shard148of194.bin", "group1-shard149of194.bin", "group1-shard150of194.bin", "group1-shard151of194.bin", "group1-shard152of194.bin", "group1-shard153of194.bin", "group1-shard154of194.bin", "group1-shard155of194.bin", "group1-shard156of194.bin", "group1-shard157of194.bin", "group1-shard158of194.bin", "group1-shard159of194.bin", "group1-shard160of194.bin", "group1-shard161of194.bin", "group1-shard162of194.bin", "group1-shard163of194.bin", "group1-shard164of194.bin", "group1-shard165of194.bin", "group1-shard166of194.bin", "group1-shard167of194.bin", "group1-shard168of194.bin", "group1-shard169of194.bin", "group1-shard170of194.bin", "group1-shard171of194.bin", "group1-shard172of194.bin", "group1-shard173of194.bin", "group1-shard174of194.bin", "group1-shard175of194.bin", "group1-shard176of194.bin", "group1-shard177of194.bin", "group1-shard178of194.bin", "group1-shard179of194.bin", "group1-shard180of194.bin", "group1-shard181of194.bin", "group1-shard182of194.bin", "group1-shard183of194.bin", "group1-shard184of194.bin", "group1-shard185of194.bin", "group1-shard186of194.bin", "group1-shard187of194.bin", "group1-shard188of194.bin", "group1-shard189of194.bin", "group1-shard190of194.bin", "group1-shard191of194.bin", "group1-shard192of194.bin", "group1-shard193of194.bin", "group1-shard194of194.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [128], "dtype": "float32"}, {"name": "dense/kernel", "shape": [25088, 7200], "dtype": "float32"}, {"name": "dense/bias", "shape": [7200], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [7200, 3088], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [3088], "dtype": "float32"}]}]}